
&НаКлиенте
Процедура Загрузить(Команда)
	#Если ВебКлиент тогда
		Сообщить("Данный механизм не доступен");
		Возврат;
	#КонецЕсли
		
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ОповещениеЗавершения = Новый ОписаниеОповещения("КаталогНачалоВыбораЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Перем ПутьКФайлу;
    
	Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ПутьКФайлу = Результат[0];
    #Если ВебКлиент тогда
		Возврат;	
	#Иначе
		ПрочитатьCSV(ПутьКФайлу, ",");		
    #КонецЕсли
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПрочитатьCSV(ИмяФайла, Разделитель)
	Текст = Новый ЧтениеТекста(ИмяФайла,"CESU-8");
	Массив = Новый Массив;
	
	Текст.ПрочитатьСтроку();
	ТекСтрока = Текст.ПрочитатьСтроку();
	Счетчик = 0;
	
	Пока ТекСтрока <> Неопределено и Счетчик < 1500000000 Цикл 
		МассивЗначений = СтрРазделить(ТекСтрока, Разделитель);
		Массив.Добавить(МассивЗначений);

		ТекСтрока = Текст.ПрочитатьСтроку();
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Текст.Закрыть();
	СозданиеДокументовИзТаблицы(Массив);	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СозданиеДокументовИзТаблицы(Таблица)	
	ЗаписьПакетаДанныхСервер.СозданиеДокументовВФоне(Таблица);	
КонецПроцедуры

#КонецОбласти